; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v3 ?v6)
		(pred_4 ?v5)
		(pred_5 ?v7)
		(pred_2 ?v7)
		(pred_6 ?v5 ?v7)
		(pred_3)
		(pred_1 ?v5))

   (:action op_2
       :parameters  (?v1 ?v2)
       :precondition (and (not-eq ?v1 ?v2) 
                          (pred_5 ?v1) (pred_5 ?v2) (pred_2 ?v1))
       :effect (and  (pred_2 ?v2)
		     (not (pred_2 ?v1))))


   (:action op_3
       :parameters (?v8 ?v4)
       :precondition  (and  (pred_4 ?v8) (pred_5 ?v4)
			    (pred_6 ?v8 ?v4) (pred_2 ?v4) (pred_3))
       :effect (and (pred_1 ?v8)
		    (not (pred_6 ?v8 ?v4)) 
		    (not (pred_3))))

   (:action op_1
       :parameters  (?v8  ?v4)
       :precondition  (and  (pred_4 ?v8) (pred_5 ?v4)
			    (pred_1 ?v8) (pred_2 ?v4))
       :effect (and (pred_6 ?v8 ?v4)
		    (pred_3)
		    (not (pred_1 ?v8)))))

; problem
(define (problem ferry-l5-c3)
(:domain ferry)
(:objects obj_05 obj_08 obj_02 obj_04 obj_07 
          obj_01 obj_06 obj_03 
)
(:init
(pred_5 obj_05)
(pred_5 obj_08)
(pred_5 obj_02)
(pred_5 obj_04)
(pred_5 obj_07)
(pred_4 obj_01)
(pred_4 obj_06)
(pred_4 obj_03)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_08 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(pred_3)
(pred_6 obj_01 obj_08)
(pred_6 obj_06 obj_07)
(pred_6 obj_03 obj_04)
(pred_2 obj_04)
)
(:goal
(and
(pred_6 obj_01 obj_08)
(pred_6 obj_06 obj_05)
(pred_6 obj_03 obj_05)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_06 obj_05) (pred_2 obj_08))
    (sometime-before  (pred_6 obj_03 obj_05) (pred_2 obj_08))
  )
)
)

; plan
1. (op_3 obj_03 obj_04)
   deleted: (pred_6 obj_03 obj_04) (pred_3)
   added: (pred_1 obj_03)
   goals met: 1 of 3
2. (op_2 obj_04 obj_08)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_08)
   goals met: 1 of 3
3. (op_1 obj_03 obj_08)
   deleted: (pred_1 obj_03)
   added: (pred_6 obj_03 obj_08) (pred_3)
   goals met: 1 of 3
4. (op_2 obj_08 obj_07)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_07)
   goals met: 1 of 3
5. (op_3 obj_06 obj_07)
   deleted: (pred_6 obj_06 obj_07) (pred_3)
   added: (pred_1 obj_06)
   goals met: 1 of 3
6. (op_2 obj_07 obj_05)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_05)
   goals met: 1 of 3
7. (op_1 obj_06 obj_05)
   deleted: (pred_1 obj_06)
   added: (pred_6 obj_06 obj_05) (pred_3)
   goals met: 2 of 3
8. (op_2 obj_05 obj_08)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_08)
   goals met: 2 of 3
9. (op_3 obj_03 obj_08)
   deleted: (pred_6 obj_03 obj_08) (pred_3)
   added: (pred_1 obj_03)
   goals met: 2 of 3
10. (op_2 obj_08 obj_05)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_05)
   goals met: 2 of 3
11. (op_1 obj_03 obj_05)
   deleted: (pred_1 obj_03)
   added: (pred_6 obj_03 obj_05) (pred_3)
   goals met: 3 of 3
